{
  "version": "2025-09-27.5",
  "entity": "Sentinel",
  "role": "guardian",
  "status": "operational",
  "description": "Governed guardian responsible for audit routing, signature enforcement, and user safety posture inside the ACI runtime.",
  "audit": {
    "router_config": "library/audit/audit_router.json",
    "default_mode": "audit_router.tracehub.session",
    "export_instruction": "Enable the matching governance toggle for the export sink (audit_router.tracehub.export or audit_router.tva_ledger.export) and then set \"export_override\" to that router key before invoking pipelines.sentinel.audit so governed exports accompany the session log only when approved."
  },
  "guidance": [
    "TraceHub session retention remains anchored to audit_router.tracehub.session with output scoped to /memory/audit/tracehub/session for the active runtime window.",
    "TVA ledger checkpoints continue to use audit_router.tva_ledger.session and stay provisional under /memory/audit/tva_ledger/session until export overrides are approved.",
    "When persistent exports are required, enable the desired export sink (audit_router.tracehub.export or audit_router.tva_ledger.export) through its governance toggle before invoking pipelines.sentinel.audit.",
    "Provide export_override only when the export toggle is active, setting it to the router sink key you enabled (audit_router.tracehub.export or audit_router.tva_ledger.export) so the pipeline composes the governed export event.",
    "Export sinks that require signatures must carry Sentinel-approved metadata; confirm signature fields are populated or the router will reject the override."
  ],
  "changelog": [
    {
      "version": "2025-09-27.5",
      "notes": [
        "Aligned Sentinel audit guidance with the export_override pipeline parameter so router sink overrides and governance toggles stay in sync.",
        "Clarified that export_override must only be provided after the matching router export mode is toggled on for TraceHub or TVA promotions."
      ]
    },
    {
      "version": "2025-09-27.4",
      "notes": [
        "Documented router sink override instructions to ensure audit_router.tracehub.export and audit_router.tva_ledger.export are configured before enabling persistent exports.",
        "Reinforced the requirement to toggle governance controls alongside sink selection for pipelines.sentinel.audit runs."
      ]
    },
    {
      "version": "2025-09-27.3",
      "notes": [
        "Clarified export overrides to reference explicit router sink key selection prior to running pipelines.sentinel.audit.",
        "Documented signature enforcement expectations for export sinks and aligned guidance messaging with the router configuration."
      ]
    },
    {
      "version": "2025-09-27.2",
      "notes": [
        "Directed callers to set export_override to the desired audit router sink key when requesting governed exports.",
        "Clarified TraceHub vs TVA override usage and reinforced signature expectations for export promotions."
      ]
    },
    {
      "version": "2025-09-27.1",
      "notes": [
        "Promoted Sentinel from placeholder to operational guardian.",
        "Linked the audit router configuration and documented export vs session-only behavior.",
        "Clarified signature enforcement expectations tied to export-enabled runs."
      ]
    }
  ]
}
